<?php include "../../functions.php"; luwrain_begin_page('/doc/sponsors/index.php', luwrain_current_lang() == 'ru'?'Для спонсоров':'For sponsors');?>
<?php if (luwrain_current_lang() == 'en') {?>

<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
                <h1>Финансовая поддержка</h1>
                <p>
                  Luwrain очень нуждается в&#160;серьёзной финансовой поддержке. Проект будет развиваться
                  в&#160;любых обстоятельствах, но участники не&#160;имеют возможности заниматься им без&#160;постоянной
                  сторонней работы для&#160;заработка. Мы обращаемся с&#160;просьбой ко&#160;всем организациям,
                  которые могут выступить источниками финансирования нашей деятельности, поддержать нас!
                </p>
                <p>
                  Авторы проекта обращают внимание фондов, работающих на&#160;территории Российской Федерации,
                  на&#160;следующие вещи:
                </p>
                <ul>
                  <li>
                    Luwrain может быть платформой для&#160;предоставления электронных государственных услуг,
                    которая обеспечит качественный доступ к&#160;ним людям с&#160;нарушениями зрения; таких
                    людей огромное количество, и проблема равноправного доступа действительно существует;
                  </li>
                  <li>
                    направление нашей работы востребовано во&#160;всём мире и помогает обратить на&#160;российские
                    технологии внимание организации из&#160;всех стран (к&#160;примеру, о&#160;Luwrain <a target="_blank" href="http://dl.acm.org/citation.cfm?id=2687234&CFID=464939051&CFTOKEN=29213994">рассказано</a>
                    в&#160;электронной библиотеке ACM, и мы думаем, что это только начало);
                  </li>
                  <li>
                    вложение финансовых средств в&#160;Luwrain &#x2014; это вложение в&#160;серьёзные технологии,
                    поскольку по&#160;сложности реализации Luwrain не&#160;уступает многим промышленным платформам
                    в&#160;мире ИТ;
                  </li>
                  <li>
                    Luwrain находится в&#160;итоговой фазе непосредственной реализации, имея технологический
                    прототип; НИОКР проводились, начиная с&#160;2002&#160;г., мы поставили огромное количество
                    экспериментов, практически исключающих вероятность технологической неудачи;
                  </li>
                  <li>
                    Luwrain полностью отвечает современным требованиям импортозамещения в&#160;сфере высоких
                    технологий;
                  </li>
                  <li>
                    вложения в&#160;Luwrain дадут долгосрочный эффект, поскольку полученные результаты сохранят
                    актуальность на&#160;протяжении длительного периода времени и улучшат условия жизни огромного
                    количества людей в&#160;России и за&#160;её пределами;
                  </li>
                  <li>
                    Luwrain разрабатывается людьми, понимающими существующие проблемы во&#160;всей их&#160;сложности;
                    эксперименты успешно проводились в&#160;том числе и в&#160;рамках учебного процесса, включая
                    аспирантуру и защиту диссертации на&#160;соискание степени кандидата наук;
                  </li>
                  <li>
                    наша цель достижима, и в&#160;первую очередь благодаря современному развитию программных
                    компонентов из&#160;мира <a target="_blank" href="http://ru.wikipedia.org/wiki/%D0%A1%D0%B2%D0%BE%D0%B1%D0%BE%D0%B4%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BD%D0%BE%D0%B5_%D0%BE%D0%B1%D0%B5%D1%81%D0%BF%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5">СПО</a>;
                    от&#160;нас и наших спонсоров требуется только настойчивость в&#160;доведении начатого
                    дела до&#160;конца.
                  </li>
                </ul>
                <p>
                  Если Вы имеете возможность нас поддержать, пожалуйста, напишите нам на&#160;адрес <a href="mailto:luwrain@gmail.com">luwrain@gmail.com</a>
                  не&#160;откладывая! При&#160;желании узнать о&#160;нашей работе больше, вы можете просмотреть
                  <a target="_blank" href="whttp://ww.youtube.com/watch?v=m-HOWJCRn7g3">видеоматериал &#x22;Компьютер
                  для&#160;незрячих&#x22; на&#160;Youtube</a>, подготовленный замечательным журналистом Светланой
                  Глазыриной.
                </p>

<?php }?>
<?php luwrain_end_page('/doc/sponsors/index.php');?>
