<?php include "../../functions.php"; luwrain_begin_page('/doc/difference/index.php', luwrain_current_lang() == 'ru'?'Чем LUWRAIN отличается от~других вспомогательных технологий?':'Why is LUWRAIN different than other accessible solutions?');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>Why is LUWRAIN different than other accessible solutions?</h1>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>Чем LUWRAIN отличается от&#160;других вспомогательных технологий?</h1>

<p>Самое главное отличие LUWRAIN от&#160;известных приложений, на&#160;первый взгляд  делающих очень похожие вещи, в&#160;том,
что <strong>LUWRAIN&#160;&#x2014; это не&#160;утилита экранного доступа</strong>.
LUWRAIN&#160;&#x2014; это платформа для&#160;разработки невизуальных приложений, которая  в&#160;широком смысле нацелена на&#160;сферу всех возможных применений,
включая "Интернет вещей" и "Умный дом",
хотя поддержка людей с&#160;нарушениями зрения, действительно, является одним из&#160;очень важных   направлений нашей деятельности.</p>

<p>Природа платформы позволяет нам создавать и распространять приложения, которые раньше отсутствовали.
К&#160;примеру, в&#160;процессе образования правильнее иметь решение, гарантированно решающее необходимые задачи технического обеспечения,
нежеле  пытаться адаптировать образовательный процесс под&#160;постоянно меняющиеся и очень нестабильные утилиты экранного доступа,
не&#160;дающие гарантий, что  завтра не&#160;появится новая задача, абсолютно  несовместимая с&#160;обычными вспомогательными технологиями.
Вместе с&#160;нами коммерческие компании могут создавать и предлагать инструменты доступа к&#160;своим продуктам,
которые будут гарантированно доступны и удобны людям, нуждающимся в&#160;невизуальном способе взаимодействия с&#160;ИТ.</p>

<p>Помимо этого, концепция платформы  даёт нам возможность исследовать вопросы дизайна невизуального взаимодействия, чтобы добиться нового уровня скорости и комфорта работы.
Дизайн&#160;&#x2014; это прежде всего предельная функциональная эффективность,
основы которой кроются в&#160;способах представления информации,
максимально адаптированном для&#160;невизуального восприятия.</p>

<p>Да, в&#160;мире есть три&#160;проекта, исповедующие схожие принципы:
<a href="http://www.yourdolphin.com/productdetail.asp?id=30">Dolphin Guide.</a> ,
<a href="http://emacspeak.sourceforge.net">Emacspeak.</a> и
<a href="http://www.knopper.net/knoppix-adriane/index-en.html">Adriane</a>,
но мы всё&#160;равно лучше.
Даже анализировать не&#160;стоит.</p>
<?php }?>
<?php luwrain_end_page('/doc/difference/index.php');?>
