<?php include "../../functions.php"; luwrain_begin_page('/doc/about/index.php', luwrain_current_lang() == 'ru'?'О проекте':'About the project');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>About our&#160;project</h1>

<p>See&#160;also:</p>

<ul>
<li><a href="<?php echo luwrain_link('/doc/difference/');?>">Why is&#160;LUWRAIN different than other accessible solutions?</a></li>
<li><a href="<?php echo luwrain_link('/doc/faq/');?>">Frequently asked questions</a></li>
<li><a href="<?php echo luwrain_link('/doc/legal/');?>">Legal notes</a></li>
<li><a href="<?php echo luwrain_link('/community/publications/');?>">Our&#160;publications and the&#160;press about us</a></li>
<li><a href="<?php echo luwrain_link('/doc/authors/');?>">Who we are?</a></li>
</ul>

<p>LUWRAIN is information technologies and a&#160;lifestyle!
The&#160;LUWRAIN team works on&#160;the&#160;new way of&#160;interaction  with&#160;PCs, which gives the&#160;maximum level of&#160;comfort to&#160;users with&#160;eyesight problems, 
regardless their degree of&#160;disability (including deaf-blind).
Our&#160;obtained experience we implement as&#160;a&#160;Java library, published under the&#160;terms of&#160;GNU&#160;Public License v.3.</p>

<p>LUWRAIN mostly (but not limited to) is&#160;purposed for&#160;the&#160;blind,
who previously was unable to&#160;start using of&#160;PC or any other IT.
Today IT means a&#160;comfort and a&#160;lifestyle, it is a&#160;design and a&#160;pragmatism. 
For&#160;the&#160;disable people all of&#160;these terms exist the&#160;same way as&#160;for&#160;anybody else,
but can take another forms.
We have differences between each other; the&#160;difference between all&#160;of&#160;us results in&#160;using of&#160;different solutions, it&#160;is absolutely normal;
IT for&#160;the&#160;blind must be&#160;created in&#160;the&#160;way, which suits needs as&#160;most as&#160;possible.</p>

<p>LUWRAIN ведёт себя одинаково на&#160;всех ОС, в&#160;которых может быть запущен
(что достигается за&#160;счёт технологий Java).
Появление единого и переносимого механизма доставки невизуальных приложений значительно упрощает информационное обеспечение образовательного процесса,
в&#160;который вовлечены учащиеся с&#160;нарушениями зрения.
LUWRAIN предоставляет простой в&#160;освоении и удобный в&#160;работе способ чтения образовательных материалов,
дающий одинаковое восприятие в&#160;любой ОС.</p>

<p>Коммерческие компании получают возможность при&#160;помощи LUWRAIN обеспечить доступ к&#160;своим сервисам,
пполностью перекладывая на&#160;нас заботу о&#160;правильном восприятии людьми с&#160;нарушениями зрения.
Компании могут подготавливать свои приложения для&#160;LUWRAIN по&#160;тем&#160;же причинам, по&#160;которым публикуют приложения для&#160;мобильных телефонов, &#x2014; это повышает удобство пользователя.
Более того, приложения для&#160;LUWRAIN подготавливаются на&#160;Java,
что существенно облегчает использование готовых компонентов, ранее созданных для&#160;Google Android.</p>

<p>И&#160;всё-таки в&#160;центре нашей деятельности находится сам&#160;наш&#160;основной дистрибутив LUWRAIN.
Он доступен для&#160;<a href="<?php echo luwrain_link('/download/');?>">свободной загрузки</a> с&#160;нашего сайта,
и поможет каждому незрячему  (в&#160;том&#160;числе слепоглухому) получить инструмент, обеспечивающий решение наиболее востребованных повседневных задач.
Если для&#160;каких-либо целей задач наш продукт окажется не&#160;в&#160;состоянии предложить решение,
за&#160;счёт его&#160;гибкости пользователь всегда сможет сочетать его с&#160;существующими приложениями экранного доступа. </p>

<h2>Ключевые характеристики</h2>

<ol>
<li><strong>LUWRAIN имеет предельно упрощенный, но в&#160;то&#160;же время продуманный и гибкий, интерфейс для&#160;незрячего человека.</strong>
Пользователь может не&#160;опасаться, что ему не&#160;хватит опыта работы на&#160;ПК для&#160;эксплуатации LUWRAIN.
Несколько простых примеров для&#160;первого знакомства окажутся достаточными,
чтобы быстро начать работу.
У&#160;нас нет&#160;сомнений, что&#160;LUWRAIN подойдёт для любой категории пользователей:детей, незрячих от&#160;рождения,
пожилых людей,
слепоглухих 
и&#160;т.&#160;д.</li>
<li><strong>LUWRAIN  создан на&#160;основе технологий Java.</strong>
Пользоваться LUWRAIN можно на&#160;любом компьютере и в&#160;любой ОС,
для&#160;которых есть виртуальная машина Java не&#160;ниже версии 1.8,
а она есть практически для&#160;любой современной ОС.</li>
<li><strong>LUWRAIN &#x2014; очень технологичное решение.</strong>
Наша команда старается применять как&#160;можно более современные технологие, 
которые с&#160;наибольшей вероятностью будут востребованы в&#160;будущем.
К&#160;примеру, наш браузер основан на актуальном движке <a href="https://ru.wikipedia.org/wiki/WebKit">WebKit</a>,
а&#160;благодаря хорошей интеграции GNU/Linux во&#160;встраиваемые системы мы исследуем возможность развития LUWRAIN 
в&#160;рамках современного направления <a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82_%D0%B2%D0%B5%D1%89%D0%B5%D0%B9">"интернета вещей"</a>.</li>
<li><strong>LUWRAIN &#x2014; свободное ПО.</strong>
Его&#160;использование всегда бесплатно для&#160;конечного пользователя.
Лицензия GPL&#160;v.3 гарантирует, что пользователь никогда не&#160;лишиться инструмента, к&#160;которому он&#160;привык,
равно как&#160;и&#160;любая компания, подготовившая на&#160;основе LUWRAIN свой&#160;продукт.</li>
<li><strong>LUWRAIN имеет сборку в&#160;виде ISO-образа на&#160;ядре Linux.</strong>
Даже если у&#160;пользователя нет&#160;вообще никакой возможности приобрести или установить какую-либо ОС,
т.&#160;е. у&#160;него есть только компьютер с&#160;пустым жёстким диском,
он всё&#160;равно может пользоваться LUWRAIN,
если выберет вариант в&#160;виде <a href="<?php echo luwrain_link('/download/iso/');?>">загрузочного ISO-образа</a>.</li>
</ol>

<h2>Интерфейс специально для&#160;незрячих людей</h2>

<p>Неспособность представить информацию в&#160;подготовленном виде &#x2014; один из&#160;главных недостатков  самого распространённого решения,
основанного на&#160;утилитах экранного доступа,
работающих в&#160;оконном интерфейсе.
Без&#160;использования мыши, недоступной незрячим пользователям,  этот тип интерфейса неудобен.
Он плохо подходит для&#160;выполнения повседневных задач,
требующих предельного уровня скорости и комфорта.
Более того,  если у&#160;пользователя отсутствует предшествующий опыт визуальной работы с&#160;оконным интерфейсом,
процесс знакомства с&#160;ним и объяснение его&#160;природы может быть очень сложным.</p>

<p>Незрячий пользователь всегда хранит образ своего рабочего окружения в&#160;голове,
получая от&#160;компьютера информацию  о&#160;любых изменениях.
Наша задача состоит в&#160;том,
чтобы сделать воображаемое рабочее пространство <strong>предельно простым</strong>.
Чем оно проще, тем больше у&#160;пользователя окажется возможности  сосредоточиться на&#160;своей работе.
заметим, что при&#160;использовании утилит экранного доступа пользователь вынужден хранить в&#160;памяти  полный вид рабочего стола и расположения объектов,
хотя это невозможно в&#160;принципе,
какими&#160;бы совершенными утилиты экранного доступа ни&#160;были.
Наш опыт показывает,
что создание нового интерфейса,
который не&#160;уступал&#160;бы возможностям оконного окружения,
вполне <strong>реально</strong>,
если, конечно, речь идёт о&#160;задачах,
в&#160;принципе доступных незрячему человеку
(к&#160;примеру, редактирование фотографий незрячему человеку недоступно).</p>

<h2>Большие проблемы</h2>

<p>LUWRAIN стремится быть частью усилий, направленных на&#160;решение более общих проблем, чем  доступность незрячих людей к&#160;ИТ.
Правда действительности в&#160;том, что незрячие люди очень мало пользуются тем, что для&#160;них делается:
редко встретишь человека в&#160;Москве, который пользуется тактильной разметкой (вне&#160;зависимости от&#160;причин),
мало кто ходит на&#160;выставки, которые делаются для&#160;незрячих людей, 
мало кто пользуется информационными сервисами, созданными для&#160;людей с&#160;нарушениями зрения.
Команда LUWRAIN стремится уделять как можно больше внимания вопросам активности незрячих людей в&#160;целом
и вносить свой вклад к&#160;улучшение положения вещей.
Для&#160;этого мы сотрудничаем с&#160;общественными и благотворительными организациями 
с&#160;целью влияния на&#160;менталитет незрячих людей через создание качественно новых ИТ для&#160;них.</p>

<p><a href="<?php echo luwrain_link('/community/');?>">Присоединяйтесь к&#160;нам!</a></p>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>О&#160;нашем проекте</h1>

<p>См.&#160;также:</p>

<ul>
<li><a href="<?php echo luwrain_link('/doc/difference/');?>">Чем LUWRAIN отличается от&#160;других вспомогательных технологий?</a></li>
<li><a href="<?php echo luwrain_link('/doc/faq/');?>">Часто задаваемые вопросы</a></li>
<li><a href="<?php echo luwrain_link('/doc/legal/');?>">Правовой статус</a></li>
<li><a href="<?php echo luwrain_link('/community/publications/');?>">Наши публикации и пресса о&#160;нас</a></li>
<li><a href="<?php echo luwrain_link('/doc/authors/');?>">Авторы проекта</a></li>
</ul>

<h2>Что такое LUWRAIN?</h2>

<p>Проект LUWRAIN  посвящён разработке ПО в&#160;сфере  невизуального использования информационных технологий (ИТ),
то&#160;есть в&#160;случаях, когда экран ПК или мобильного устройства  не&#160;является основным способом передачи данных.
Работа в&#160;проекте LUWRAIN разбивается на&#160;несколько крупных направлений:</p>

<ol>
<li>Разработка основной платформы для&#160;создания и распространения невизуальных приложений.</li>
<li>Разработка двух семейств приложений для&#160;нашей платформы:
<ul>
<li>приложения общего назначения для&#160;повседневной работы, включая доступ к&#160;популярным сервисам в&#160;интернете;</li>
<li>образовательные приложения для&#160;детей и студентов с&#160;нарушениями зрения.</li>
<li>Исследование методологии построения невизуального интерфейса и семантических структур для&#160;голосового управления информационными объектами.</li>
<li>Разработка технологий для&#160;быстрой и дешёвой адаптации материалов, прежде всего учебных,  для&#160;представления в&#160;невизуальной форме.</li>
<li>Создание учебной литературы в&#160;формате Daisy по&#160;заказу издательств и образовательных учреждений.</li>
</ul></li>
</ol>

<p>Создание инструментов для&#160;людей с&#160;нарушениями зрения является очень важным направлением LUWRAIN,
хотя цели нашего проекта не&#160;ограничиваются вспомогательными  технологиями.
По&#160;косвенным оценкам только 1%  людей с&#160;нарушениями зрения в&#160;России чувствуют себя свободно в&#160;работе на&#160;ПК,
LUWRAIN призван улучшить эту&#160;ситуацию, делая ИТ более дружественными и комфортными в&#160;режиме невизуального взаимодействия.
Мы также активно поддерживаем проведение исследований в&#160;сфере клинической психологии,
чтобы лучше понять природу проблем мотивации и социализации  детей и взрослых людей с&#160;нарушениями зрения.</p>

<p>В&#160;настоящий момент возможны только два&#160;способа осуществления образовательного процесса людей с&#160;нарушениями зрения: методики на&#160;основе алфавита Брайля и при&#160;помощи ИТ.
Алфавит Брайля остаётся надёжным инструментом, но не&#160;отвечает всем современным требованиям.
Мы уделяем большое внимание подготовке образовательных приложений и материалов, а&#160;также
внедрению и распространению издательских систем, таких как Latex и Lilypond,
которые незаслуженно остаются в&#160;стороне от&#160;внимания большинства людей.
Мы были&#160;бы очень рады установлению контактов с&#160;крупными  организациями
с&#160;целью проведения исследований возможности трудоустройства в&#160;них людей с&#160;нарушениями зрения
и целенаправленной подготовке для&#160;этого  специалистов в&#160;ВУЗах, с&#160;которыми мы сотрудничаем.</p>

<p>LUWRAIN&#160;&#x2014; это не&#160;только ИТ, это также дизайн и стиль жизни.
До&#160;нас очень мало уделялось вниманию комфорту в&#160;сфере невизуальной работы,
хотя нетрудно понять, что это такая&#160;же сфера применения дизайна, как и графические оконные  системы.
Мы много работаем над&#160;тем, чтобы наша система предоставляла информацию в&#160;виде,
максимально адаптированном для&#160;невизуального восприятия,
а&#160;пользователь получал&#160;бы удовольствие от&#160;работы в&#160;LUWRAIN.</p>

<h2>Технические особенности LUWRAIN</h2>

<p>Ядро нашей платформы подготовлено на&#160;базе технологий Java.
Это даёт возможность предоставить единое восприятие системы вне&#160;зависимости от&#160;того какая операционная система (ОС) установлена на&#160;компьютере пользователя.</p>

<p>Мы также оформляем нашу&#160;платформу в&#160;виде ISO-образа на&#160;основе Ubuntu Linux,
что делает возможным её&#160;использование даже в&#160;том случае, если на&#160;компьютере пользователя вовсе нет&#160;никакой ОС.
Это очень важная особенность, потому что LUWRAIN в&#160;таком виде доступен для&#160;установке на&#160;жёсткий диск без&#160;визуального контроля,
не&#160;говоря уже о&#160;том, что это отличная возможность для&#160;людей с&#160;нарушениями зрения погрузиться в&#160;мир GNU/Linux.</p>

<p>LUWRAIN&#160;&#x2014; свободное программное обеспечение (СПО).
Все&#160;пользователи и организации могут использовать нашу платформу и набор основных приложений совершенно бесплатно,
а компании способны провести аудит исходных текстов для&#160;проверки отсутствия недокументированных возможностей.</p>

<p>Мы уделяем много времени проведению научных исследований в&#160;следующих сферах:</p>

<ul>
<li>машинное обучение в&#160;сфере обработки веб-страниц с&#160;целю определения основного их&#160;содержания для&#160;ускорения работы;</li>
<li>семантические структуры для&#160;реализации интуитивно понятных путей голосового управления для&#160;задач "Умного дома" и "Интернета вещей";</li>
<li>машинное обучение для&#160;задач быстрой адаптации слабоструктурированных текстов для&#160;конвертации в&#160;невизуальную форму.</li>
</ul>

<p><a href="<?php echo luwrain_link('/community/');?>">Присоединяйтесь к&#160;нам!</a></p>
<?php }?>
<?php luwrain_end_page('/doc/about/index.php');?>
