<?php include "../../functions.php"; luwrain_begin_page('/doc/about/index.php', luwrain_current_lang() == 'ru'?'О проекте':'About the project');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>About our&#160;project</h1>

<p>See&#160;also:</p>

<ul>
<li><a href="<?php echo luwrain_link('/doc/difference/');?>">Why is&#160;LUWRAIN different than other accessible solutions?</a></li>
<li><a href="<?php echo luwrain_link('/doc/faq/');?>">Frequently asked questions</a></li>
<li><a href="<?php echo luwrain_link('/doc/legal/');?>">Legal notes</a></li>
<li><a href="<?php echo luwrain_link('/community/publications/');?>">Our&#160;publications and the&#160;press about us</a></li>
<li><a href="<?php echo luwrain_link('/doc/authors/');?>">Who we are?</a></li>
</ul>

<p>LUWRAIN is information technologies and a&#160;lifestyle!
The&#160;LUWRAIN team works on&#160;the&#160;new way of&#160;interaction  with&#160;PCs, which gives the&#160;maximum level of&#160;comfort to&#160;users with&#160;eyesight problems, 
regardless their degree of&#160;disability (including deaf-blind).
Our&#160;obtained experience we implement as&#160;a&#160;Java library, published under the&#160;terms of&#160;GNU&#160;Public License v.3.</p>

<p>LUWRAIN mostly (but not limited to) is&#160;purposed for&#160;the&#160;blind,
who previously was unable to&#160;start using of&#160;PC or any other IT.
Today IT means a&#160;comfort and a&#160;lifestyle, it is a&#160;design and a&#160;pragmatism. 
For&#160;the&#160;disable people all of&#160;these terms exist the&#160;same way as&#160;for&#160;anybody else,
but can take another forms.
We have differences between each other; the&#160;difference between all&#160;of&#160;us results in&#160;using of&#160;different solutions, it&#160;is absolutely normal;
IT for&#160;the&#160;blind must be&#160;created in&#160;the&#160;way, which suits needs as&#160;most as&#160;possible.</p>

<p>LUWRAIN ведёт себя одинаково на&#160;всех ОС, в&#160;которых может быть запущен
(что достигается за&#160;счёт технологий Java).
Появление единого и переносимого механизма доставки невизуальных приложений значительно упрощает информационное обеспечение образовательного процесса,
в&#160;который вовлечены учащиеся с&#160;нарушениями зрения.
LUWRAIN предоставляет простой в&#160;освоении и удобный в&#160;работе способ чтения образовательных материалов,
дающий одинаковое восприятие в&#160;любой ОС.</p>

<p>Коммерческие компании получают возможность при&#160;помощи LUWRAIN обеспечить доступ к&#160;своим сервисам,
пполностью перекладывая на&#160;нас заботу о&#160;правильном восприятии людьми с&#160;нарушениями зрения.
Компании могут подготавливать свои приложения для&#160;LUWRAIN по&#160;тем&#160;же причинам, по&#160;которым публикуют приложения для&#160;мобильных телефонов, &#x2014; это повышает удобство пользователя.
Более того, приложения для&#160;LUWRAIN подготавливаются на&#160;Java,
что существенно облегчает использование готовых компонентов, ранее созданных для&#160;Google Android.</p>

<p>И&#160;всё-таки в&#160;центре нашей деятельности находится сам&#160;наш&#160;основной дистрибутив LUWRAIN.
Он доступен для&#160;<a href="<?php echo luwrain_link('/download/');?>">свободной загрузки</a> с&#160;нашего сайта,
и поможет каждому незрячему  (в&#160;том&#160;числе слепоглухому) получить инструмент, обеспечивающий решение наиболее востребованных повседневных задач.
Если для&#160;каких-либо целей задач наш продукт окажется не&#160;в&#160;состоянии предложить решение,
за&#160;счёт его&#160;гибкости пользователь всегда сможет сочетать его с&#160;существующими приложениями экранного доступа. </p>

<h2>Ключевые характеристики</h2>

<ol>
<li><strong>LUWRAIN имеет предельно упрощенный, но в&#160;то&#160;же время продуманный и гибкий, интерфейс для&#160;незрячего человека.</strong>
Пользователь может не&#160;опасаться, что ему не&#160;хватит опыта работы на&#160;ПК для&#160;эксплуатации LUWRAIN.
Несколько простых примеров для&#160;первого знакомства окажутся достаточными,
чтобы быстро начать работу.
У&#160;нас нет&#160;сомнений, что&#160;LUWRAIN подойдёт для любой категории пользователей:детей, незрячих от&#160;рождения,
пожилых людей,
слепоглухих 
и&#160;т.&#160;д.</li>
<li><strong>LUWRAIN  создан на&#160;основе технологий Java.</strong>
Пользоваться LUWRAIN можно на&#160;любом компьютере и в&#160;любой ОС,
для&#160;которых есть виртуальная машина Java не&#160;ниже версии 1.8,
а она есть практически для&#160;любой современной ОС.</li>
<li><strong>LUWRAIN &#x2014; очень технологичное решение.</strong>
Наша команда старается применять как&#160;можно более современные технологие, 
которые с&#160;наибольшей вероятностью будут востребованы в&#160;будущем.
К&#160;примеру, наш браузер основан на актуальном движке <a href="https://ru.wikipedia.org/wiki/WebKit">WebKit</a>,
а&#160;благодаря хорошей интеграции GNU/Linux во&#160;встраиваемые системы мы исследуем возможность развития LUWRAIN 
в&#160;рамках современного направления <a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82_%D0%B2%D0%B5%D1%89%D0%B5%D0%B9">"интернета вещей"</a>.</li>
<li><strong>LUWRAIN &#x2014; свободное ПО.</strong>
Его&#160;использование всегда бесплатно для&#160;конечного пользователя.
Лицензия GPL&#160;v.3 гарантирует, что пользователь никогда не&#160;лишиться инструмента, к&#160;которому он&#160;привык,
равно как&#160;и&#160;любая компания, подготовившая на&#160;основе LUWRAIN свой&#160;продукт.</li>
<li><strong>LUWRAIN имеет сборку в&#160;виде ISO-образа на&#160;ядре Linux.</strong>
Даже если у&#160;пользователя нет&#160;вообще никакой возможности приобрести или установить какую-либо ОС,
т.&#160;е. у&#160;него есть только компьютер с&#160;пустым жёстким диском,
он всё&#160;равно может пользоваться LUWRAIN,
если выберет вариант в&#160;виде <a href="<?php echo luwrain_link('/download/iso/');?>">загрузочного ISO-образа</a>.</li>
</ol>

<h2>Интерфейс специально для&#160;незрячих людей</h2>

<p>Неспособность представить информацию в&#160;подготовленном виде &#x2014; один из&#160;главных недостатков  самого распространённого решения,
основанного на&#160;утилитах экранного доступа,
работающих в&#160;оконном интерфейсе.
Без&#160;использования мыши, недоступной незрячим пользователям,  этот тип интерфейса неудобен.
Он плохо подходит для&#160;выполнения повседневных задач,
требующих предельного уровня скорости и комфорта.
Более того,  если у&#160;пользователя отсутствует предшествующий опыт визуальной работы с&#160;оконным интерфейсом,
процесс знакомства с&#160;ним и объяснение его&#160;природы может быть очень сложным.</p>

<p>Незрячий пользователь всегда хранит образ своего рабочего окружения в&#160;голове,
получая от&#160;компьютера информацию  о&#160;любых изменениях.
Наша задача состоит в&#160;том,
чтобы сделать воображаемое рабочее пространство <strong>предельно простым</strong>.
Чем оно проще, тем больше у&#160;пользователя окажется возможности  сосредоточиться на&#160;своей работе.
заметим, что при&#160;использовании утилит экранного доступа пользователь вынужден хранить в&#160;памяти  полный вид рабочего стола и расположения объектов,
хотя это невозможно в&#160;принципе,
какими&#160;бы совершенными утилиты экранного доступа ни&#160;были.
Наш опыт показывает,
что создание нового интерфейса,
который не&#160;уступал&#160;бы возможностям оконного окружения,
вполне <strong>реально</strong>,
если, конечно, речь идёт о&#160;задачах,
в&#160;принципе доступных незрячему человеку
(к&#160;примеру, редактирование фотографий незрячему человеку недоступно).</p>

<h2>Большие проблемы</h2>

<p>LUWRAIN стремится быть частью усилий, направленных на&#160;решение более общих проблем, чем  доступность незрячих людей к&#160;ИТ.
Правда действительности в&#160;том, что незрячие люди очень мало пользуются тем, что для&#160;них делается:
редко встретишь человека в&#160;Москве, который пользуется тактильной разметкой (вне&#160;зависимости от&#160;причин),
мало кто ходит на&#160;выставки, которые делаются для&#160;незрячих людей, 
мало кто пользуется информационными сервисами, созданными для&#160;людей с&#160;нарушениями зрения.
Команда LUWRAIN стремится уделять как можно больше внимания вопросам активности незрячих людей в&#160;целом
и вносить свой вклад к&#160;улучшение положения вещей.
Для&#160;этого мы сотрудничаем с&#160;общественными и благотворительными организациями 
с&#160;целью влияния на&#160;менталитет незрячих людей через создание качественно новых ИТ для&#160;них.</p>

<p><a href="<?php echo luwrain_link('/community/');?>">Присоединяйтесь к&#160;нам!</a></p>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>О&#160;нашем проекте</h1>

<p>См.&#160;также:</p>

<ul>
<li><a href="<?php echo luwrain_link('/doc/difference/');?>">Чем LUWRAIN отличается от&#160;других вспомогательных технологий?</a></li>
<li><a href="<?php echo luwrain_link('/doc/faq/');?>">Часто задаваемые вопросы</a></li>
<li><a href="<?php echo luwrain_link('/doc/legal/');?>">Правовой статус</a></li>
<li><a href="<?php echo luwrain_link('/community/publications/');?>">Наши публикации и пресса о&#160;нас</a></li>
<li><a href="<?php echo luwrain_link('/doc/authors/');?>">Авторы проекта</a></li>
</ul>

<p>LUWRAIN &#x2014; это информационные технологии и стиль жизни!
Команда LUWRAIN работает над&#160;реализацией пользовательского интерфейса, который предоставляет максимальный уровень комфорта 
для&#160;людей с&#160;нарушениями зрения любой степени ограничений (в&#160;том&#160;числе слепоглухих).
Полученный опыт мы оформляем в&#160;виде библиотеки на&#160;языке Java, свободно распространяемой под&#160;лицензией GPL&#160;v.3.</p>

<p>LUWRAIN в&#160;значительной мере (но не&#160;только) ориентирован на&#160;аудиторию незрячих людей, которые до&#160;настоящего момента не&#160;могли начать использование ПК или других ИТ.
ИТ сегодня &#x2014; это комфорт и стиль жизни, 
дизайн и прагматизм.
Для&#160;людей с&#160;ограниченными возможностями эти&#160;понятия существуют точно так&#160;же, как и для&#160;всех остальных,
но   приобретают иные формы.
Мы все разные, наши различия влияют на&#160;выбор вещей, которыми мы пользуемся, это абсолютно нормально,
и ИТ для&#160;людей с&#160;нарушениями зрения должны быть такими, 
какие подходят для&#160;них лучше всего.</p>

<p>LUWRAIN ведёт себя одинаково на&#160;всех ОС, в&#160;которых может быть запущен
(что достигается за&#160;счёт технологий Java).
Появление единого и переносимого механизма доставки невизуальных приложений значительно упрощает информационное обеспечение образовательного процесса,
в&#160;который вовлечены учащиеся с&#160;нарушениями зрения.
LUWRAIN предоставляет простой в&#160;освоении и удобный в&#160;работе способ чтения образовательных материалов,
дающий одинаковое восприятие в&#160;любой ОС.</p>

<p>Коммерческие компании получают возможность при&#160;помощи LUWRAIN обеспечить доступ к&#160;своим сервисам,
полностью перекладывая на&#160;нас заботу о&#160;правильном восприятии людьми с&#160;нарушениями зрения.
Компании могут разрабатывать свои приложения для&#160;LUWRAIN, преследуя те&#160;же цели, к&#160;которым они стремятся, публикуя    приложения для&#160;мобильных телефонов, &#x2014; это повышает удобство пользователя.
Более того, приложения для&#160;LUWRAIN подготавливаются на&#160;Java,
что существенно облегчает использование готовых компонентов, ранее созданных для&#160;Google Android.</p>

<p>И&#160;всё-таки в&#160;центре нашей деятельности находится сам&#160;наш&#160;основной дистрибутив LUWRAIN.
Он доступен для&#160;<a href="<?php echo luwrain_link('/download/');?>">свободной загрузки</a> с&#160;нашего сайта,
и поможет каждому незрячему  (в&#160;том&#160;числе слепоглухому) получить инструмент, обеспечивающий решение наиболее востребованных повседневных задач.
Если для&#160;каких-либо целей задач наш продукт окажется не&#160;в&#160;состоянии предложить решение,
за&#160;счёт его&#160;гибкости пользователь всегда сможет сочетать его с&#160;существующими приложениями экранного доступа. </p>

<h2>Ключевые характеристики</h2>

<ol>
<li><strong>LUWRAIN имеет предельно упрощенный, но в&#160;то&#160;же время продуманный и гибкий интерфейс для&#160;незрячего человека.</strong>
Пользователь может не&#160;опасаться, что ему не&#160;хватит опыта работы на&#160;ПК для&#160;эксплуатации LUWRAIN.
Несколько простых примеров для&#160;первого знакомства окажутся достаточными,
чтобы быстро начать работу.
У&#160;нас нет&#160;сомнений, что&#160;LUWRAIN подойдёт для любой категории пользователей: детей, незрячих от&#160;рождения,
пожилых людей,
слепоглухих 
и&#160;т.&#160;д.</li>
<li><strong>LUWRAIN  создан на&#160;основе технологий Java.</strong>
Пользоваться LUWRAIN можно на&#160;любом компьютере и в&#160;любой ОС,
для&#160;которых есть виртуальная машина Java не&#160;ниже версии 1.8,
а она есть практически для&#160;любой современной ОС.</li>
<li><strong>LUWRAIN &#x2014; высокотехнологичное решение.</strong>
Наша команда старается применять как&#160;можно более современные технологии, 
которые с&#160;наибольшей вероятностью будут востребованы в&#160;будущем.
К&#160;примеру, наш браузер основан на актуальном движке <a href="https://ru.wikipedia.org/wiki/WebKit">WebKit</a>,
а&#160;благодаря хорошей интеграции GNU/Linux во&#160;встраиваемые системы мы исследуем возможность развития LUWRAIN 
в&#160;рамках современного направления <a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82_%D0%B2%D0%B5%D1%89%D0%B5%D0%B9">"интернета вещей"</a>.</li>
<li><strong>LUWRAIN &#x2014; свободное ПО.</strong>
Его&#160;использование всегда бесплатно для&#160;конечного пользователя.
Лицензия GPL&#160;v.3 гарантирует, что пользователь никогда не&#160;лишиться инструмента, к&#160;которому он&#160;привык,
равно как&#160;и&#160;любая компания, подготовившая на&#160;основе LUWRAIN свой&#160;продукт.</li>
<li><strong>LUWRAIN имеет сборку в&#160;виде ISO-образа на&#160;ядре Linux.</strong>
Даже если у&#160;пользователя нет&#160;вообще никакой возможности приобрести или установить какую-либо ОС,
т.&#160;е. у&#160;него есть только компьютер с&#160;пустым жёстким диском,
он всё&#160;равно может пользоваться LUWRAIN,
если выберет вариант в&#160;виде <a href="<?php echo luwrain_link('/download/iso/');?>">загрузочного ISO-образа</a>.</li>
</ol>

<h2>Интерфейс специально для&#160;незрячих людей</h2>

<p>Неспособность представить информацию в&#160;подготовленном виде &#x2014; один из&#160;главных недостатков  самого распространённого решения,
основанного на&#160;утилитах экранного доступа,
работающих в&#160;оконном интерфейсе.
Без&#160;использования мыши, недоступной незрячим пользователям,  этот тип интерфейса неудобен.
Он плохо подходит для&#160;выполнения повседневных задач,
требующих предельного уровня скорости и комфорта.
Более того,  если у&#160;пользователя отсутствует предшествующий опыт визуальной работы с&#160;оконным интерфейсом,
процесс знакомства с&#160;ним и объяснение его&#160;природы может быть очень сложным.</p>

<p>Незрячий пользователь всегда хранит образ своего рабочего окружения в&#160;голове,
получая от&#160;компьютера информацию  о&#160;любых изменениях.
Наша задача состоит в&#160;том,
чтобы сделать воображаемое рабочее пространство <strong>предельно простым</strong>.
Чем оно проще, тем больше у&#160;пользователя окажется возможности  сосредоточится на&#160;своей работе.
Заметим, что при&#160;использовании утилит экранного доступа пользователь вынужден хранить в&#160;памяти  полный вид рабочего стола и расположения объектов,
хотя это невозможно в&#160;принципе,
какими&#160;бы совершенными утилиты экранного доступа ни&#160;были.
Наш опыт показывает,
что создание нового интерфейса,
который не&#160;уступал&#160;бы возможностям оконного окружения,
вполне <strong>реально</strong>,
если, конечно, речь идёт о&#160;задачах,
в&#160;принципе доступных незрячему человеку.
(к&#160;примеру, редактирование фотографий незрячему человеку недоступно).</p>

<h2>Решение социальных задач</h2>

<p>LUWRAIN стремится быть частью усилий, направленных на&#160;решение более общих проблем, чем  доступность незрячих людей к&#160;ИТ.
Правда действительности в&#160;том, что незрячие люди очень мало пользуются тем, что для&#160;них делается:
редко встретишь человека в&#160;Москве, который пользуется тактильной разметкой (вне&#160;зависимости от&#160;причин),
мало кто ходит на&#160;выставки, которые делаются для&#160;незрячих людей, 
мало кто пользуется информационными сервисами, созданными для&#160;людей с&#160;нарушениями зрения.
Команда LUWRAIN стремится уделять как можно больше внимания вопросам активности незрячих людей в&#160;целом
и вносить свой вклад в&#160;улучшение положения вещей.
Для&#160;этого мы сотрудничаем с&#160;общественными и благотворительными организациями 
с&#160;целью влияния на&#160;менталитет незрячих людей через создание качественно новых ИТ для&#160;них.</p>

<p><a href="<?php echo luwrain_link('/community/');?>">Присоединяйтесь к&#160;нам!</a></p>
<?php }?>
<?php luwrain_end_page('/doc/about/index.php');?>
