<?php include "../../../../functions.php"; luwrain_begin_page('/community/massmedia/2019/tst/index.php', luwrain_current_lang() == 'ru'?'почему мы в технологическом социальном тупике':'Mass media about us');?>
<?php if (luwrain_current_lang() == 'en') {?>

<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>почему мы в технологическом социальном тупике</h1>

<p><a href="https://te-st.ru/">"Теплица социальных технологий"</a>,
Юлия Каленкова,
15&#160;июля 2019&#160;г.</p>

<p>Источник: <a href="https://te-st.ru/2019/07/10/mikhail-pozidaev-about-what-inclusion-not-work/">https://te-st.ru/2019/07/10/mikhail-pozidaev-about-what-inclusion-not-work/</a></p>

<p>IT-индустрия в интересном положении&#160;&#x2014; это технологический социальный тупик. Для незрячих есть
адаптивные технологии и специальные программы обучения. Проблема первых&#160;&#x2014; исключительно
формальная доступность, а вторых&#160;&#x2014; оторванность от реальности. Я уверен, что ситуацию можно и
нужно менять. Над этим мы с коллегами работаем уже несколько лет.</p>

<p>Объясню на примере. С одной стороны, в IT-продуктах, например в Windows, достаточное количество
функций, которыми могут пользоваться незрячие. Физически возможность нажать на кнопку, не глядя
на нее, есть. С другой стороны, эта доступность сама по себе мало полезна, когда нужно решать
комплексные технические задачи.</p>

<p>Еще пара примеров: для незрячих создан нотный редактор GNU LilyPond&#160;&#x2014; если почитать, как он
работает, можно понять, почему им пользуется буквально несколько технически продвинутых
специалистов. В сфере образования есть интерактивные приложения, но сфера их применения
сильно ограничена. Можно сделать тифлоцифровую таблицу Менделеева, но попробуйте подобным
образом объяснить незрячему устройство кровеносной системы?</p>

<p>Программирование&#160;&#x2014; отдельная история. Для человека, мало знакомого с IT, все выглядит просто:
пишешь текст, компьютер его обрабатывает, и вот он результат. Но на деле все сложнее&#160;&#x2014; это и
вычислительная математика, и графические алгоритмы, и «упаковка» информации… Чтобы освоить
эти навыки, слабовидящим нужны специальные устройства и, конечно, помощь специалистов.</p>

<p>Работа в IT&#160;&#x2014; это комплексный процесс и растущий поток задач: просто знать кнопки недостаточно.
Между физической доступностью и практической применимостью настоящая пропасть. Главный
недостаток технических решений для слабовидящих&#160;&#x2014; недостаточная функциональность. Чтобы
решить эту проблему, мы создали платформу Luwrain. В команде проекта, помимо меня, есть
специалисты Алексей Голошумов и Елена Теплых.</p>

<pre><code>Luwrain позволяет работать с большинством текстовых документов, изучать страницы в
Интернете и общаться в Сети, не используя зрение. Философия платформы&amp;nbsp;&amp;mdash; гарантированная
доступность. Если возникает вопрос, можно ли через Luwrain решить какую-либо техническую
задачу, ответ прост: «да».
</code></pre>

<p>Это написанная на Java пользовательская среда, в которой задействованы невизуальные способы
взаимодействия человека с компьютером. Обратная связь осуществляется голосом или при
необходимости через брайлевский дисплей. Одно из приложений платформы без установки Office
«понимает» txt, html, doc, docx, xlsx и без обратной связи читает html и pdf. То есть Luwrain в этом
смысле самодостаточен. Это достигается за счет множества готовых библиотек, созданных для
Java.</p>

<h2>Как подростки видят свое будущее</h2>

<p>Я не верю в то, что все сайты в ближайшем будущем будут адаптированы для слабовидящих. Наша
платформа позволяет осваивать IT с любыми ограничениями по зрению, но само ее применение
под вопросом. Почему? Это не востребовано. В России количество незрячих и слабовидящих
составляет порядка 200 тысяч человек, из них абсолютно слепых&#160;&#x2014; половина. Сколько среди них
пользователей ПК? Меньше, чем вы думаете, и уж точно недостаточно для полноценного
внедрения Luwrain в широкую практику.</p>

<p>Незрячие уверены, что учиться трудно и не нужно. Они думают, что программирование никак не
изменит их жизнь, а значит, и прикладывать усилия незачем. Это мнение подкрепляет и
общественная парадигма, тиражируя стереотипы вроде «незрячий&#160;&#x2014; это одинокий и замкнутый
человек». Согласитесь, с такой «характеристикой» сложно устроиться на работу.
Добавьте сюда
невключенность государства, и мы получим достаточно плачевную ситуацию: со всех сторон
бездействие.</p>

<p>Однажды я выступал перед параллелью одиннадцатиклассников одного из лучших учебных заведений
для незрячих. На вопрос, куда вы будете поступать, 30% ответили&#160;&#x2014; «учиться на массажиста».
Массажист и музыкант&#160;&#x2014; два классических пути трудоустройства. Что подростки думают о
программировании? Это сложно, долго, неперспективно. А между тем все наоборот&#160;&#x2014; да, изучение
требует времени, но профессия позволяет отлично зарабатывать, не привязываясь к
местонахождению.</p>

<p>Я говорю с такой уверенностью, потому что убедился в этом на собственном опыте. Зрение потерял,
когда учился на первом курсе в Томском государственном университете. Ушел в двухлетний
академический отпуск, но через несколько лет успешно окончил факультет информатики и защитил
кандидатскую диссертацию по техническим дисциплинам.</p>

<h2>Как Luwrain помогает слабовидящим</h2>

<p>Мотивировать незрячего изучать программирование&#160;&#x2014; невообразимый труд. Даже учитывая то, что
преимущества Luwrain легко продемонстрировать. Платформа лишена недостатков стандартных
утилит, которые незрячие обычно устанавливают поверх операционной системы. Последние
работают медленно и в целом они трудны для применения на том уровне, где можно получить какой-либо
полезный эффект.</p>

<p>В чем отличия Luwrain? Пользователи могут самостоятельно вносить изменения в программный код,
подстраивая его под личные нужды. Платформа сделана как самораспаковывающийся
дистрибутив (форма распространения программного обеспечения). Она включает в себя
расширяемый набор приложений, с помощью которого незрячий человек легко взаимодействует с
компьютером. Это комплексный продукт&#160;&#x2014; он создан и для отдельных пользователей, и для целых
организаций.</p>

<pre><code>Luwrain подходит для личного применения (как самостоятельная ОС или приложение), в
качестве средства подготовки рабочего места или обучения людей с нарушениями зрения
(система адаптируется под конкретного сотрудника), или как инструмент для разработки
собственных невизуальных приложений.
</code></pre>

<p>Но что нам это дает? Программирование нужно осваивать с детства, но попробуйте скажите
слабовидящему ребенку, что он будет изучать утилиты и дистрибутивы. Ему и так сложно
приспособиться к жизни. Одна из наших главных проблем&#160;&#x2014; отсутствие адекватной педагогической
практики. Здесь мало быть просто талантливым и профессиональным педагогом, нужна личная
заинтересованность и гигантский запас терпения. У незрячих детей особая психика. Сейчас у нас
три партнера: московская школа-интернат № 1 для обучения и реабилитации слепых, которую
возглавляет Иван Вишневецкий, а также Национальный исследовательский Томский
государственный университет и Томский государственный педагогический университет.</p>

<p>В частности мы работаем с заведующей кафедрой дефектологии ТГПУ Натальей Мёдовой, поскольку
стремимся адаптировать процесс обучения, сделать его доступным и интересным для ребят. Это
важно, когда мы хотим работать на перспективу и масштабировать опыт. Нельзя просто посадить
ребенка писать код, нужно вдохновить его на эксперименты, ведь программирование&#160;&#x2014; это и есть
проверка гипотез, поиск лучших способов работы алгоритмов.</p>

<p>Работа идет медленно: сами незрячие, как уже говорил, слабо мотивированы&#160;&#x2014; сказывается общая
ситуация с трудоустройством в стране и отсутствие в информационном пространстве успешных
примеров. Учебные заведения соответственно видят эту незаинтересованность и тоже снижают
градус энтузиазма. Мы же как разработчики понимаем&#160;&#x2014; потенциал таких IT-продуктов, как
Luwrain, не раскрыт. Нами движет техническая увлеченность, а конкретно мной еще и собственный
опыт&#160;&#x2014; я знаю, что можно преодолеть трудности и получить классную профессию.</p>

<h2>Как масштабировать опыт Luwrain</h2>

<p>Поскольку платформа Luwrain бесплатная, многие интересуются вопросом финансирования
проекта. История интересная. Однажды я познакомился с коллегой из Китая. Он основал в
Шэньчжэне, Китай, компанию, которая занимается видеомонтажом. Особенность фирмы в том, что все
сотрудники&#160;&#x2014; люди с ограниченными возможностями, в основном с нарушениями
опорно-двигательного аппарата. Они занимаются постпродакшн&#160;&#x2014; обрабатывают видео, работая с
заказчиками по всему миру. Им отдают задачи, на которые компании не хотят тратить ни время, ни
ресурсы. Получилась такая работающая экономическая модель, которую я захотел взять на
вооружение.</p>

<p>По возвращении в Россию на базе нашей компании мы начали создавать подобную систему выполнения
заказов. В корпоративной среде масса рутинной работы, на выполнении которой можно сэкономить
силы и деньги&#160;&#x2014; от сортировок заявок колл-центра до верификации переводов. Мы привлекаем
слабовидящих людей к выполнению подобных задач&#160;&#x2014; получается стратегия win win. Для нас это самое
эффективное коммерческое направление, потому что гранты&#160;&#x2014; это разовая помощь (которую к тому же
не так просто получить), а привлечение инвестиций требует выстроенной стратегии монетизации.
Парадокс в том, что социальная значимость проекта не ставит его в выигрышное положение в
бизнесе.</p>

<p>Сейчас у нас две проблемы, которые можно решить, лишь наладив сотрудничество со сторонними
специалистами. Первая&#160;&#x2014; стратегическая, вторая&#160;&#x2014; информационная.</p>

<p>С точки зрения стратегии, нужно ответить на вопросы, какие научные сферы мы должны задействовать
для развития (перспективы применения платформы достаточно широкие, но мы пока сосредоточены
только на образовании), в какие сроки на какие результаты можно рассчитывать (именно такие
вопросы о масштабировании задают нам инвесторы) и, наконец, какой общий эффект от применения
платформы (это важно в общегосударственном масштабе, поскольку поддержка нам нужна
всесторонняя).</p>

<p>Нам необходима компетентная стратегическая оценка: очертить пул задач и определить
необходимые ресурсы для их решения. Я знаю, что образовательная платформа легко превращается
в успешную коммерческую модель, но практики в данном вопросе нет&#160;&#x2014; нужна помощь.</p>

<p>Вторая проблема, информационная, как раз затрудняет решение первой. У нас большая страна, не
имеющая выстроенных связей с незрячими людьми. Как нам рассказать о проекте, заинтересовать
в изучении платформы, наладить сотрудничество с регионами? Условно для слабовидящих есть три
сайта, но их аудитория крайне мала и пассивна.</p>

<p>Между тем у незрячих огромный потенциал. Вспомните Джона Мильтона, диктовавшего свой
«Потерянный Рай» (будучи слепым, английский поэт диктовал текст своим друзьям и дочери.&#160;&#x2014; Прим.
ред.), или Гомера&#160;&#x2014; половина найденных древнегреческих литературных папирусов&#160;&#x2014; отрывки из
его произведений (традиционно Гомер изображается слепцом.&#160;&#x2014; Прим. ред.). У слабовидящих
невероятно развито воображение, просто пообщайтесь с ними и вы поймете образ их мышления,
способность визуализировать все явления, события, слова. У таких людей развита самокритика и
самоанализ, мозг компенсирует отсутствие зрительной коммуникации.</p>

<p>Многие, в том числе и сами незрячие, думают&#160;&#x2014; проще всего наладить систему пенсионных выплат по
инвалидности. Но я бы хотел, чтобы каждый ответил на вопрос: хотят ли они, чтобы в России были
квалифицированные, социально интегрированные граждане? Если ответ «да», клубок социальных и
экономических проблем будет распутываться.</p>
<?php }?>
<?php luwrain_end_page('/community/massmedia/2019/tst/index.php');?>
