<?php include "../../functions.php"; luwrain_begin_page('/products/reader/index.php', luwrain_current_lang() == 'ru'?'Reader':'Reader');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>Products</h1>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>LUWRAIN Reader</h1>

<p>LUWRAIN Reader&#160;&#x2014; бесплатное кроссплатформенное автономное приложение для&#160;людей с&#160;нарушениями зрения,
предназначенное для&#160;чтения книг и просмотра документов.
Необходимость работы с&#160;большим количеством литературы как&#160;при&#160;помощи интерактивной навигации, так и в&#160;режиме последовательного прослушивания&#160;&#x2014;
одна из&#160;самых актуальных задач, возникающих у&#160;людей с&#160;нарушениями зрения.
Для её&#160;решения мы поддерживаем отдельное приложение на&#160;основе нашей платформы LUWRAIN,
с&#160;возможностями которого вы можете ознакомиться ниже.
Приложение полностью бесплатное для коммерческого и некоммерческого использования.</p>

<h2>Загрузка файлов</h2>

<p>Версия LUWRAIN Reader для&#160;Microsoft Windows </p>

<p>Текущая версия LUWRAIN Reader: 2.0.0.</p>

<ul>
<li>Версия для Microsoft Windows</li>
<li><p>DВерсия для GGNU/Linux</p></li>
<li><p>Интграция с сервисами:</p></li>
<li><p>Википедия* DuckDuckGo</p></li>
</ul>

<p>Поддержка форматов:
* Daisy
* HTML
* DOC, DOCX, XSL
* PDF
* TXT</p>

<p>Перегонка записей в аудиофайлы
Расширяемоесть на основе скрипотов JavaSciript</p>
<?php }?>
<?php luwrain_end_page('/products/reader/index.php');?>
