<?php include "../../functions.php"; luwrain_begin_page('/products/education/index.php', luwrain_current_lang() == 'ru'?'Продукты для образования':'Products for education');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>Products for education</h1>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>Продукты для&#160;образования</h1>

<p>Команда LUWRAIN предоставляет продукты и услуги для&#160;технического  обеспечения
процесса образования на&#160;всей его протяжённости: от&#160;дошкольного до&#160;высшего профессионального.
Мы подходим к&#160;этой работе комплексно, т.&#160;е. стараемся брать на&#160;себя  решение различных смежных задач
и находимся в&#160;постоянном контакте  с&#160;педагогами и преподавателями различных учебных учреждений.
Крупнейших наших партнёров в&#160;этой сфере вы можете найти на&#160;<a href="<?php echo luwrain_link('/doc/authors/');?>">соответствующей странице</a>.</p>

<p>В&#160;решении образовательных задач мы руководствуемся  следующими принципами:</p>

<ol>
<li><strong>Максимальная автоматизация  решаемых задач.</strong>
Мы работаем над&#160;исследованием современных методик  обработки информации с&#160;целю получение дешёвых способов адаптации учебных  материалов.
К&#160;их числу относится прежде всего автоматические методы синхронизации текста и речи при&#160;изготовлении  книг в&#160;формате Daisy,
а&#160;также исследование методик машинного обучения для&#160;получения  качественно оформленных учебников и вопросов для&#160;проведения тестирования из&#160;слаьбоструктурированных данных.
Достижение успеха в&#160;этой сфере возможно только в&#160;случае, когда ручной труд   максимально устранён,
потому что количество материалов, требующих обработки, огромное.</li>
<li><strong>Максимальное снятие нагрузки и ответственности с&#160;преподавателей.</strong>
Согласно нашему опыту один из&#160;главных барьеров  инклюзивного образования  связан с&#160;тем,
что основная нагрузка  и забота об&#160;обучении ребёнка или студента с&#160;нарушениями зрения ложится  на&#160;преподавателя,
который в&#160;большинстве случаев не&#160;имеет опыта инклюзивного образования и чаще всего не&#160;имеет времени на&#160;то, чтобы уделять больше внимания одному из&#160;учащихся.
Мы готовы предоставлять необходимую компетенцию в&#160;том, чтобы помочь правильно  организовать процесс обучения,
переложив как&#160;можно больше задач на&#160;ИТ,
тем&#160;самым снимая с&#160;педагога чрезмерную  нагрузку.</li>
</ol>

<p>Предоставление образовательных услуг нашей командой осуществляется на&#160;платной основе.
Мы стараемся  предлагать такие возможности,
чтобы это оказалась экономически более выгодно, чем   приобретение дорогостоящей тифлотехники и дорогостоящего ПО.
Помимо этого, использование наших продуктов   намного проще и надёжнее с&#160;точки зрения  лицензионной политики,
потому что мы способны предоставить необходимую платформу,  содержащую  только свободные компоненты  (СПО).
Если вы хотите воспользоваться нашими продуктами и услугами,
напишите нам, пожалуйста, как это описано на&#160;<a href="<?php echo luwrain_link('/doc/contacts/');?>">соответствующей странице</a>,
и наш представитель свяжется с&#160;вами.</p>
<?php }?>
<?php luwrain_end_page('/products/education/index.php');?>
