<?php include "../../functions.php"; luwrain_begin_page('/products/education/index.php', luwrain_current_lang() == 'ru'?'Продукты для образования':'Products for education');?>
<?php if (luwrain_current_lang() == 'en') {?>
<h1>Products for education</h1>
<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
<h1>Продукты для образования</h1>

<p>На&#160;базе <a href="<?php echo luwrain_link('/download/');?>">нашего рабочего окружения</a> команда LUWRAIN предоставляет ряд продуктов и услуг для&#160;задач образования людей с&#160;нарушениями зрения, в&#160;том числе слепоглухих.</p>

<h2>Чтение образовательных материалов</h2>

<p>В&#160;составе рабочего окружения LUWRAIN  предоставляется приложение, 
дающее возможность удобной и быстрой навигации в&#160;гипертекстовых учебных материалах, 
оснащённых синхронизированной записью диктора и распространяемых в&#160;формате Daisy.
К&#160;числу основных возможностей нашего приложения относятся:</p>

<ul>
<li>быстрая навигация по&#160;иерархическому оглавлению;</li>
<li>поиск текстового выражения в&#160;документе;</li>
<li>установка закладок;</li>
<li>управление записью диктора с&#160;одновременным слежением за&#160;текущем положением в&#160;учебнике;</li>
<li>отображение текста учебника на&#160;экране для&#160;слабовидящих пользователей и на&#160;брайлевском дисплее для&#160;слепоглухих;</li>
<li>быстрой вызов переводчика для&#160;фрагмента учебника;</li>
<li>быстрое выполнение  поиска в&#160;Google или в&#160;Википедии для&#160;произвольного слова или фразы в&#160;учебнике.</li>
</ul>

<h2>Организация контрольных работ и самопроверок</h2>

<p>В&#160;составе рабочего окружения LUWRAIN  также предоставляется  приложение для&#160;организации тестов в&#160;режиме контрольной работы или самопроверки.
Наборы вариантов размещаются в&#160;облачном хранилище, 
что позволяет организовать коллективный доступ как с&#160;компьютеров внутри образовательного учреждения,
так и с&#160;домашних компьютеров учеников и преподавателей.
Приложения для управления вариантами и для&#160;прохождения тестов выполнены полностью внутри интерфейса LUWRAIN и, таким образом,
являются полностью доступными для&#160;пользователей с&#160;любым уровнем нарушений зрения.</p>

<p>Мы называем это&#160;направление "Электронная школа".
Вы можете найти дополнительную информацию о&#160;нём в&#160;<a href="http://wiki.luwrain.org/">соответствующем разделе LUWRAIN Wiki</a>.</p>

<h2>Подготовка учебных материалов в&#160;синхронизированных форматах</h2>

<p>Наша команда занимается разработкой учебных материалов в&#160;формате Daisy
для&#160;обеспечения учебного процесса в&#160;общеобразовательных учреждениях, занимающихся обучением людей с&#160;нарушениями зрения.
Подготовку таких материалов мы выполняем при&#160;помощи программного обеспечения, полностью разработанного внутри нашей команды.
Пилотным проектом по&#160;этому направлению является учебник "Обществознание" для&#160;учащихся 10-го класса.
Дополнительную информацию вы можете также найти в&#160;<a href="http://wiki.luwrain.org/">соответствующем разделе LUWRAIN&#160;Wiki</a>.</p>

<h2>Предоставление услуг</h2>

<p>Предоставление образовательных материалов  и услуг по&#160;технической поддержке образовательных учреждений 
наша команда выполняет после заключения договора. 
В&#160;рамках этого договора мы занимаемся:</p>

<ul>
<li>установкой и настройкой облачного хранилища для&#160;обработки материалов тестов;</li>
<li>предоставление дистрибутивов нашего рабочего окружения с&#160;модификациями по&#160;желанию заказчика;</li>
<li>предоставлением и изготовлением образовательных материалов.</li>
</ul>

<p>Образовательное направление нашего проекта мы ведём при&#160;стратегической поддержке коллег из&#160;<a href="http://schisv1.mskobr.ru/">Школы-интерната № 1 для&#160;обучения и реабилитации слепых г.&#160;Москва</a>.</p>
<?php }?>
<?php luwrain_end_page('/products/education/index.php');?>
