<?php include "../../functions.php"; luwrain_begin_page('/doc/faq/index.php', luwrain_current_lang() == 'ru'?'Часто задаваемые вопросы':'Frequently asked questions');?>
<?php if (luwrain_current_lang() == 'en') {?>

<?php }?>
<?php if (luwrain_current_lang() == 'ru') {?>
                <h1>Часто задаваемые вопросы</h1>
                <h2>Кто может быть пользователем Luwrain?</h2>
                <p>Мы выделяем три&#160;группы потенциальных пользователей:</p>
                <ol>
                  <li>
                    Люди с&#160;нарушениями зрения, которые в&#160;силу разнообразных причин (финансовые барьеры,
                    непонимание поведения утилит экранного доступа, непонимание организации оконного интерфейса
                    и&#160;т.&#160;д.) ранее не&#160;имели возможности работать на&#160;ПК, включая детей,
                    рождённых слепыми, и людей пожилого возраста.
                  </li>
                  <li>
                    Опытные пользователи с&#160;нарушениями зрения, которые ищут инструмент для&#160;эффективного
                    и комфортного выполнения фиксированного набора наиболее востребованных задач.
                  </li>
                  <li>
                    Разработчики ПО, которые хотели&#160;бы создавать приложения в&#160;форме, максимально
                    понятной и доступной людям с&#160;нарушениями зрения, но не&#160;имеющие опыта в&#160;области
                    вспомогательных технологий.
                  </li>
                </ol>
                <h2>Является&#160;ли Luwrain конкурирующей технологией для&#160;утилит экранного доступа?</h2>
                <p>
                  Нет. Luwrain продолжает направление &#x22;рабочей среды в&#160;себе&#x22;, которое развивается
                  в&#160;значительной мере независимо от&#160;популярных утилит экранного доступа. Максимальную
                  свободу и самостоятельность незрячий человек получает в&#160;том случае, если оба эти направления
                  полноценно развиты. Экранные чтецы <b>гарантируют потенциальную</b> доступность произвольного
                  функционала в&#160;любом возможном виде, в&#160;то время как платформы по&#160;принципу
                  &#x22;среда в&#160;себе&#x22; обеспечивают предоставление наиболее востребованных приложений
                  для&#160;повседневной работы в&#160;форме, <b>предельно адаптированной</b> для&#160;восприятия
                  незрячим человеком.
                </p>
                <h2>Придётся&#160;ли пользователю Luwrain отказаться от&#160;работы с&#160;прежними инструментами?</h2>
                <p>
                  Нет, поскольку Luwrain может быть установлен в&#160;виде приложения на имеющуюся операционную
                  систему. Пользователь перенесёт в&#160;Luwrain выполнение только тех&#160;задач, какие
                  пожелает. Помимо этого, прежняя операционная система может быть необходима другим членам
                  семьи или коллектива, если они используют общий компьютер с&#160;человеком, имеющим нарушения
                  зрения.
                </p>
                <h2>Почему интерфейс Luwrain подходит для&#160;незрячих людей лучше?</h2>
                <p>
                  Люди без&#160;нарушений зрения работают в&#160;оконных системах (Microsoft Windows, Apple
                  MacOS-X и&#160;др.). Разработчики оконных систем изначально проектировали их таким образом
                  чтобы получить наибольшую эффективность при&#160;работе мышью, так&#160;как она является
                  одним из&#160;самых удобных и наглядных способов управления рабочими объектами. Вместе
                  с&#160;тем, незрячим людям мышь недоступна, и это автоматически ограничивает их скорость
                  работы и уровень комфорта, поскольку они вынуждены заменять действия мышью действиями на&#160;клавиатуре.
                  Luwrain представляет объекты в&#160;форме, предельно понятной незрячему человеку, и позволяет
                  успешно управлять ими без&#160;мыши. Вы можете ознакомится с&#160;конкретным описанием
                  отличий на&#160;<a href="<?echo luwrain_link('/doc/difference/');?>">этой странице</a>.
                </p>
                <h2>Могу&#160;ли я создать своё собственное приложение для&#160;Luwrain?</h2>
                <p>
                  Конечно, мы активно поддерживаем появление сторонних приложений для&#160;Luwrain. Они могут
                  быть легко созданы на&#160;языке Java. Подробнее об&#160;этом можно узнать на&#160;<a href="<?echo luwrain_link('/doc/net-app/');?>">этой
                  странице</a>.
                </p>
                <h2>Во&#160;время работы в&#160;Luwrain экран не&#160;используется вовсе?</h2>
                <p>
                  Используется. На&#160;экран выводится информация, облегчающая работу слабовидящим пользователям.
                  Она дополняет речевой вывод, но не&#160;играет какой-либо ключевой роли.
                </p>
                <h2>Какой тип ПК подходит для&#160;Luwrain лучше всего?</h2>
                <p>
                  Мы стараемся поддерживать работу в&#160;Luwrain как на&#160;настольных, так и на&#160;мобильных
                  ПК. Для&#160;мобильных ПК лучше подходит версия Luwrain в&#160;виде самостоятельной операционной
                  системы, поскольку она задействует все возможные виды управления, включая <i>touch pad</i>,
                  что превращает ноутбук в&#160;элегантный и полезный аксессуар для&#160;незрячего человека.
                  Для&#160;настольного ПК, вероятно, лучше подойдёт версия Luwrain в&#160;виде приложения,
                  хотя установка в&#160;виде полной операционной системы остаётся всё&#160;равно возможной.
                </p>
                <h2>В&#160;каком состоянии находится разработка Luwrain в&#160;настоящий момент?</h2>
                <p>
                  Пока в&#160;стадии технологического прототипа. Работы очень много, и мы будем поэтапно
                  выводить в&#160;стабильное состояние различные компоненты. Проект очень нуждается в<a href="<?echo luwrain_link('/doc/sponsors/');?>">&#160;серьёзной
                  финансовой поддержке</a>, которая значительно ускорила&#160;бы работу и получение результата.
                </p>
                <h2>Должны&#160;ли пользователи что-либо платить за&#160;Luwrain?</h2>
                <p>
                  Нет. Luwrain &#x2014; это свободное ПО. Все материалы и результаты проекта находятся в&#160;открытом
                  доступе и распространяются бесплатно.
                </p>
                <h2>Могу&#160;ли я сделать собственную версию Luwrain?</h2>
                <p>
                  Да, но если отличия от&#160;нашей официальной версии достаточно существенные, мы попросим
                  вас для&#160;вашей сборки выбрать другое название. Вы можете найти более подробную информацию
                  о&#160;правовом статусе на&#160;<a href="<?echo luwrain_link('/doc/legal/');?>">этой странице</a>.
                </p>
                <h2>Как работает браузер в&#160;Luwrain?</h2>
                <p>
                  В&#160;Luwrain в&#160;виде самостоятельной операционной системы включён Mozilla Firefox
                  с&#160;активированными специальными возможностями. Работа с&#160;ним производится вне&#160;специализированного
                  интерфейса Luwrain, что объясняется сложностью организации современных веб-приложений,
                  но мы работаем над&#160;тем, чтобы перенести работу с&#160;браузером в&#160;интерфейс Luwrain
                  в&#160;будущем.
                </p>
                <h2>
                  В&#160;Luwrain в&#160;виде самостоятельной операционной системы запуск других приложений
                  невозможен?
                </h2>
                <p>
                  Возможен. В&#160;комплект поставки включается специальный компонент, который позволяет
                  в&#160;случае необходимости запустить оконные приложения для&#160;Linux, которые поддерживают
                  работу вспомогательных технологий в&#160;традициях AT-SPI (например, <i>Skype</i>). Помимо
                  этого, не&#160;следует забывать, что остаются доступными все&#160;приложения командной
                  строки (например, <i>ping</i> или <i>lame</i>), поскольку Luwrain имеет встроенный терминал.
                </p>
                <h2>
                  Я слышал, что для&#160;незрячих людей могут быть очень полезны издательские системы TeX
                  и Lilypond, что с&#160;ними?
                </h2>
                <p>
                  Luwrain в&#160;виде самостоятельной операционной системы продолжает оставаться обычным
                  дистрибутивом GNU/Linux. Это означает, что из&#160;доступных репозиториев можно установить
                  любой пакет или приложение, которое окажется полезным, включая TeX и Lilypond. Это по-настоящему
                  мощные пакеты, которые открывают незрячим людям множество возможностей в&#160;плане подготовки
                  печатных материалов, а&#160;также презентации для&#160;публичных выступлений. Мы активно
                  поддерживаем их&#160;использование.
                </p>
                <h2>Могут&#160;ли незрячие люди установить Luwrain на&#160;жёсткий диск самостоятельно?</h2>
                <p>
                  Да, у&#160;нас есть доступная программа установки, но необходимо помнить, что выбор загрузочного
                  устройства в&#160;настройках BIOS обычно невозможен без&#160;помощи зрячего человека.
                </p>
                <h2>Могу&#160;ли я присоединиться к&#160;проекту и внести свой вклад?</h2>
                <p>
                  Конечно, Luwrain &#x2014; это открытый проект, и все желающие могут к&#160;нему присоединиться.
                  Мы активно поддерживаем создание <a href="<?echo luwrain_link('/community/');?>">сообщества</a> вокруг нашего
                  проекта.
                </p>

<?php }?>
<?php luwrain_end_page('/doc/faq/index.php');?>
